function array_push(array) {
  let result = [];
  for (let i = 0; i < array.length; i++) {
    if (array[i] % 2 === 0) {
      result.push(array[i]);
    }
  }
  return result;
}
//////////////////////////////////////////////////////////////// приклад

let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
console.log(array_push(arr)); //виклик функції

let ar = [2, 13];
console.log(ar);
ar.push(28);
console.log(ar);

////////////////////////////////////////////////////////////////////////

let b = [1, 2, 3, 4, 5, 6];
b.pop(); // метод, що видаляє останній елемент в масиві
console.log(b);

///////////////////////////////////////////////////////////////////////

let c = [1, 2, 3, 4, 5, 6];
c.shift(); // метод, що видаляє першій елемент в масиві
console.log(c);

///////////////////////////////////////////////////////////////////////

let d = [1, 2, 3, 4, 5, 6];
d.unshift(0); // метод, що вставляє елемент в початок масиву
console.log(d);
